#############################################################
#   File Name: memmap.sh
#     Autohor: Hui Chen (c) 2020
#        Mail: chenhui13@baidu.com
# Create Time: 2020/03/28-21:34:45
#############################################################
#!/bin/sh 
#范例：查看进程的内存映像
$ cat /proc/9298/maps
#08048000-0804b000 r-xp 00000000 08:01 977399     /bin/sleep
#0804b000-0804c000 rw-p 00003000 08:01 977399     /bin/sleep
#0804c000-0806d000 rw-p 0804c000 00:00 0          [heap]
#b7c8b000-b7cca000 r--p 00000000 08:01 443354
#...
#bfbd8000-bfbed000 rw-p bfbd8000 00:00 0          [stack]
#ffffe000-fffff000 r-xp 00000000 00:00 0          [vdso]
